# GetControlPoints Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NurbsSurfaceData..::..GetControlPoints Method
NurbsSurfaceData Class See Also
---
Get the list of control points.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public IList<XYZ> GetControlPoints()
```

Visual Basic
---
```text
Public Function GetControlPoints As IList(Of XYZ)
```

Visual C++
---
```text
public:
IList<XYZ^>^ GetControlPoints()
```

# See Also
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace